import React from 'react';
import { Routes, Route } from 'react-router-dom';
import Home from './components/44.Params/Home';
// import Params from './components/44.Params/Params'
import Posts from './components/44.Params/Post';
import MainPost from './components/44.Params/MainPost';
import NotFound from './components/44.Params/NotFound';
import './components/44.Params/App.css';

export default function App44() {
  return (
    <Routes>
      <Route path='/' element={<Home />} />
      <Route path='/posts' element={<Posts />} />
      <Route path='/post/:postID' element={<MainPost />} />
      <Route path='*' element={<NotFound />} />
    </Routes>
  );
}


// اما من میخام یک روت دیگه داشته باشم به اسم پوست اسلش ایدی هر پست یعنی یک پوست اینجا توی روتم قرار بگیره که بعدش یک اسلش باشه برای من یک ایدی هم در اخرش قرار میده و اگر کاربر بخاد بیاد توی این روت برای من اطلاعات و تایتل پوستی که ایدیش دو هست رو به کاربر تشوت میده چونکه توی یوار ال م توی پستم برای من ایدی دو ارسال بشه شده یل لگر برای من ایدی سه ارسال شه و کاربر بخاد بیاد توی روت چوست اسلش سه بیام برای کاربر هام تایتله پستی که ایدیش سه هست نشونش بده درسته پس واسه این کار میام یک دونه کامپوننت دیگه میسازم به اسم مین پوست 1 مین پوست 2 مین پوست 3 مین پوست 5 مین پوست 66 مین پوست 39مین پوست 190 ,  و ایدی هر کدوم از پست ها بعد از کلمه پوست اسلش توی یو ار الم توی روتم میخام که به من ارسال بشه پس من اگر بخام برای هر کدوم از ادرس ها یک بار از کامپوننت روت استفاده بکنم واقعا کار اشتباهی است 
// من توی این روتم میخام که حتما حتما اول کلمه اسلش پوست قرار بگیره و سپس اسلش یک ایدی برام بیاد اما نمیخام حتما کلمه ایدی باشه میخام بلکه میخام یک مقداری باشه واسم پس میخام مینویسم /post/:2 
// یعنی در متن اینگلیسی خط بالا من گفتم که یک اسلش پوست باشه و اسلش یک نامبر حالا  این نامبر میتونه یک باشه دو باشه سه باشه ده باشه صد باشه پونصد باشه هر چییزی میتونه باشه 
// توی روت توی یو ار ال هر دیتایی که برامون بیاد اسمش پرامتر هست 
// ممکنه من هزار تا پوست داشته باشم پس در نتیجه من هزار تا روت هم دارم که باشه پوست اسلش 
// توی روت توی یو ار ال هر دیتایی مع برامون بیاد اسمش پرامتر هست یعنی اینحا انگار که العان برای ما یک مقدار یک پرامتر با اسم پوست ایدی با مقدار 2 ارسال شذع  