import { Details } from "@mui/icons-material";

let productDatas = [
 {
  id: 1,
  title: 'لپ تاپ 16 اینچی ایسوس مدل ROG Strix SCAR G16 G634JZR-N4111-i9 14900HX-64GB DDR5 5600MHz-2TB SSD-RTX4080-QHD 240Hz - کاستوم شده',
  image: '/47.Assets/1.png',
  caption: 'لپ‌تاپ ROG Strix G16 G634JZR یکی از بهترین گزینه‌ها در بازار لپ‌تاپ‌های گیمینگ به شمار می‌آید. این دستگاه از پردازنده‌ی قدرتمند Core i9 14900HX بهره می‌برد که همراه با 64 گیگابایت رم DDR5 با سرعت 5600 مگاهرتز، عملکردی فوق‌العاده برای اجرای بازی‌های سنگین و کارهای گرافیکی ارائه می‌دهد. همچنین، پردازنده‌ی گرافیکی GeForce RTX 4080 با 12 گیگابایت حافظه‌ی GDDR6، قدرتی بی‌نظیر در پردازش تصاویر و گرافیک‌های پیچیده فراهم می‌آورد. صفحه‌نمایش 16 اینچی این لپ‌تاپ با وضوح بالا و نرخ به‌روزرسانی 240 هرتز، تجربه‌ای بی‌نظیر و روان در بازی‌های ویدیویی ارائه می‌دهد. علاوه بر این، سیستم خنک‌کننده‌ی کارآمد، طول عمر بالای دستگاه را تضمین کرده و از افت کارایی در استفاده‌های طولانی‌مدت جلوگیری می‌کند. حافظه‌ی ذخیره‌سازی SSD دو ترابایتی این دستگاه نه تنها فضای کافی برای ذخیره‌سازی داده‌ها را فراهم می‌آورد، بلکه با سرعت بالای خود، تجربه‌ای روان و سریع در انجام امور مختلف به ارمغان می‌آورد. همچنین، این لپ‌تاپ توسط شرکت واردکننده کاستوم شده و برخی از مشخصات آن به‌طور ویژه ارتقا یافته است.',
  details: [
    {
     company: "apple",
     cpu: 'core i9 14000',
     gpu: 'Geforce RTX 4080 12GB',
     memory: '64GB DDR5',
     storage: '2TB SSD',
     display: `صفحه نمایش ROG Nebula HDR /زمان پاسخگویی 3 میلی‌ثانیه / پوشش رنگ 100 درصدی DCI-P3 / پشتیبانی از انویدیا G-Sync / پشتیبانی از MUX Switch + Nvidia Advanced Optimus / پشتیبانی از فناوری HDR دالبی ویژن `,
    },
   ],
   price: 233_700_000,
   color: 'Black'
 },
 {
  id: 2,
  title: 'لپ تاپ 15 اینچی مایکروسافت مدل Surface Laptop 6-Core Ultra 7 165H-64GB LPDDR5x-1SSD-Touch',
  image: '/47.Assets/2.png',
  caption: `کیبورد با دکمه Copilot و نور پس‌زمینه سفید /سنسور سنجش نور محیط /بدنه آلومینومی آنودایز شده /دارای میکروفون داخلی دوگانه با قابلیت Voice Focus /چیپ امنیتی TPM 2.0 و با پشتیبانی از BitLocker `,
  details: [
    {
     company: "Microsoft",
     cpu: 'Core Ultra 7 1000 intel',
     gpu: 'Arc Graphics (integrated)',
     memory: '64GB DDR5',
     storage: '1TB SSD',
     display: `صفحه نمایش لمسی با پشتیبانی از 10 لمس همزمان /پشتیبانی از قلم‌های Microsoft Pen (MPP) /تراکم پیکسلی 201 پیکسل بر اینچ /نسبت تصویر 3:2 /کنتراست 1300:1 /پروفایل‌های رنگ sRGB و Enhanced /کالیبره پیش‌فرض رنگ و قابلیت تنظیم رنگ تطبیقی /قابلیت Dolby Vision IQ /محافظ صفحه Corning Gorilla Glass 5 /ضد انعکاس نور /روشنایی حداکثری در حالت SDR تا 400 نیت `,
    },
   ],
   price: 207_490_000,
   color: 'Platinum'
 },
 {
  id: 3,
  title: 'لپ تاپ 13.8 اینچی مایکروسافت مدل Surface Laptop 7 Copilot Plus PC-Snapdragon X Elite-64GB LPDDR5x-1TB SSD-Touch',
  image: '/47.Assets/3.png',
  caption: `کیبورد مکانیکال با دکمه Copilot و نور پس‌زمینه سفید /سنسور سنجش نور محیط /بدنه آلومینومی آنودایز شده /دارای میکروفون داخلی استودیویی دوگانه با قابلیت Voice Focus /چیپ امنیتی TPM 2.0 و با پشتیبانی از BitLocker و تکنولوژی‌های امنیتی Windows 11 Secured-core PC و Pluton `,
  details: [
    {
     company: "Microsoft",
     cpu: 'Snapdragon X Elite X1E-80-100',
     gpu: 'پردازنده گرافیکی مجتمع Adreno با قدرت پردازشی 3.8 ترافلاپس',
     memory: '64GB DDR5',
     storage: '1TB SSD',
     display: `نرخ به‌روزرسانی متغیر تا 120 هرتز /صفحه نمایش لمسی با پشتیبانی از 10 لمس همزمان /پشتیبانی از قلم‌های تایید شده Microsoft Pen (MPP) /تراکم پیکسلی 201 پیکسل بر اینچ /نسبت تصویر 3:2 /کنتراست 1400:1 /پروفایل‌های رنگ sRGB و Vivid /کالیبره پیش‌فرض رنگ و قابلیت تنظیم رنگ تطبیقی /قابلیت Dolby Vision IQ /محافظ صفحه Corning Gorilla Glass 5 /روشنایی حداکثری در حالت SDR و HDR تا 600 نیت `,
    },
   ],
   price: 223_340_000,
   color: 'Black'
 },
 {
  id: 4,
  title: 'لپ تاپ 16 اینچی لنوو مدل Legion Pro 5 16IRX9-i9 14900HX-64GB DDR5-2TB SSD-RTX4070-QHD - کاستوم شده',
  image: '/47.Assets/4.png',
  caption: 'لپ‌تاپ ROG Strix G16 G634JZR یکی از بهترین گزینه‌ها در بازار لپ‌تاپ‌های گیمینگ به شمار می‌آید. این دستگاه از پردازنده‌ی قدرتمند Core i9 14900HX بهره می‌برد که همراه با 64 گیگابایت رم DDR5 با سرعت 5600 مگاهرتز، عملکردی فوق‌العاده برای اجرای بازی‌های سنگین و کارهای گرافیکی ارائه می‌دهد. همچنین، پردازنده‌ی گرافیکی GeForce RTX 4080 با 12 گیگابایت حافظه‌ی GDDR6، قدرتی بی‌نظیر در پردازش تصاویر و گرافیک‌های پیچیده فراهم می‌آورد. صفحه‌نمایش 16 اینچی این لپ‌تاپ با وضوح بالا و نرخ به‌روزرسانی 240 هرتز، تجربه‌ای بی‌نظیر و روان در بازی‌های ویدیویی ارائه می‌دهد. علاوه بر این، سیستم خنک‌کننده‌ی کارآمد، طول عمر بالای دستگاه را تضمین کرده و از افت کارایی در استفاده‌های طولانی‌مدت جلوگیری می‌کند. حافظه‌ی ذخیره‌سازی SSD دو ترابایتی این دستگاه نه تنها فضای کافی برای ذخیره‌سازی داده‌ها را فراهم می‌آورد، بلکه با سرعت بالای خود، تجربه‌ای روان و سریع در انجام امور مختلف به ارمغان می‌آورد. همچنین، این لپ‌تاپ توسط شرکت واردکننده کاستوم شده و برخی از مشخصات آن به‌طور ویژه ارتقا یافته است.',
  details: [
    {
     company: "lenovo",
     cpu: 'core i9 14000',
     gpu: 'Geforce RTX 4080 12GB',
     memory: '64GB DDR5',
     storage: '2TB SSD',
     display: `صفحه نمایش ROG Nebula HDR /زمان پاسخگویی 3 میلی‌ثانیه / پوشش رنگ 100 درصدی DCI-P3 / پشتیبانی از انویدیا G-Sync / پشتیبانی از MUX Switch + Nvidia Advanced Optimus / پشتیبانی از فناوری HDR دالبی ویژن `,
    },
   ],
   price: 233_700_000,
   color: 'Black'
 },
 {
  id: 5,
  title: 'لپ تاپ 16 اینچی ایسوس مدل ROG Strix SCAR G16 G634JZR-N4111-i9 14900HX-64GB DDR5 5600MHz-2TB SSD-RTX4080-QHD 240Hz - کاستوم شده',
  image: '/47.Assets/5.png',
  caption: 'کیبورد با نور پس زمینه قابل شخصی سازی در 4 بخش (4Zone RGB) / HDMI 2.1 ',
  details: [
    {
     company: "apple",
     cpu: 'core i9 14000 intel',
     gpu: 'Geforce RTX 4070 8GB',
     memory: '64GB DDR5',
     storage: '2TB SSD',
     display: `حداکثر میزان روشنایی: 500 نیت / پوشش 100% دامنه رنگی DCI-P3 / پشتیبانی از G-Sync / دارای DisplayHDR 400 / پشتیبانی از Dolby Vision `,
    },
   ],
   price: 164_990_000,
   color: 'Gray'
 },
 {
  id: 6,
  title: 'لپ تاپ 16.2 اینچی اپل مدل MacBook Pro MRW23 2023 LLA-M3 Pro-36GB RAM-512GB SSD',
  image: '/47.Assets/6.png',
  caption: 'لپ‌تاپ ROG Strix G16 G634JZR یکی از بهترین گزینه‌ها در بازار لپ‌تاپ‌های گیمینگ به شمار می‌آید. این دستگاه از پردازنده‌ی قدرتمند Core i9 14900HX بهره می‌برد که همراه با 64 گیگابایت رم DDR5 با سرعت 5600 مگاهرتز، عملکردی فوق‌العاده برای اجرای بازی‌های سنگین و کارهای گرافیکی ارائه می‌دهد. همچنین، پردازنده‌ی گرافیکی GeForce RTX 4080 با 12 گیگابایت حافظه‌ی GDDR6، قدرتی بی‌نظیر در پردازش تصاویر و گرافیک‌های پیچیده فراهم می‌آورد. صفحه‌نمایش 16 اینچی این لپ‌تاپ با وضوح بالا و نرخ به‌روزرسانی 240 هرتز، تجربه‌ای بی‌نظیر و روان در بازی‌های ویدیویی ارائه می‌دهد. علاوه بر این، سیستم خنک‌کننده‌ی کارآمد، طول عمر بالای دستگاه را تضمین کرده و از افت کارایی در استفاده‌های طولانی‌مدت جلوگیری می‌کند. حافظه‌ی ذخیره‌سازی SSD دو ترابایتی این دستگاه نه تنها فضای کافی برای ذخیره‌سازی داده‌ها را فراهم می‌آورد، بلکه با سرعت بالای خود، تجربه‌ای روان و سریع در انجام امور مختلف به ارمغان می‌آورد. همچنین، این لپ‌تاپ توسط شرکت واردکننده کاستوم شده و برخی از مشخصات آن به‌طور ویژه ارتقا یافته است.',
  details: [
    {
     company: "apple",
     cpu: 'نسل 3 سری M اپل ',
     gpu: 'M3 Pro Integrated 18-Cores GPU',
     memory: '32GB DDR5',
     storage: '512GB SSD',
     display: `تراکم پیکسل 254 پیکسل بر اینچ و تکنولوژی Mini-LED /کنتراست 1,000,000:1 /روشنایی 1000 نیت در حالت XDR و روشنایی 1600 نیت در حالت HDR و روشنایی 600 نیت در حالت SDR /پشتیبانی از 1 میلیارد رنگ /فناوری‌های Wide color (P3) و True Tone /فناوری ProMotion با حداکثر نرخ تازه سازی 120 هرتز `,
    },
   ],
   price: 183_290_000,
   color: 'Black'
 },
 {
  id: 7,
  title: 'لپ تاپ 15.6 اینچی ایسوس مدل TUF Gaming F15 FX507VI-LP062-i7 13620H 64GB 1SSD RTX4070 FHD L - کاستوم شده',
  image: '/47.Assets/7.png',
  caption: 'لپ‌تاپ ROG Strix G16 G634JZR یکی از بهترین گزینه‌ها در بازار لپ‌تاپ‌های گیمینگ به شمار می‌آید. این دستگاه از پردازنده‌ی قدرتمند Core i9 14900HX بهره می‌برد که همراه با 64 گیگابایت رم DDR5 با سرعت 5600 مگاهرتز، عملکردی فوق‌العاده برای اجرای بازی‌های سنگین و کارهای گرافیکی ارائه می‌دهد. همچنین، پردازنده‌ی گرافیکی GeForce RTX 4080 با 12 گیگابایت حافظه‌ی GDDR6، قدرتی بی‌نظیر در پردازش تصاویر و گرافیک‌های پیچیده فراهم می‌آورد. صفحه‌نمایش 16 اینچی این لپ‌تاپ با وضوح بالا و نرخ به‌روزرسانی 240 هرتز، تجربه‌ای بی‌نظیر و روان در بازی‌های ویدیویی ارائه می‌دهد. علاوه بر این، سیستم خنک‌کننده‌ی کارآمد، طول عمر بالای دستگاه را تضمین کرده و از افت کارایی در استفاده‌های طولانی‌مدت جلوگیری می‌کند. حافظه‌ی ذخیره‌سازی SSD دو ترابایتی این دستگاه نه تنها فضای کافی برای ذخیره‌سازی داده‌ها را فراهم می‌آورد، بلکه با سرعت بالای خود، تجربه‌ای روان و سریع در انجام امور مختلف به ارمغان می‌آورد. همچنین، این لپ‌تاپ توسط شرکت واردکننده کاستوم شده و برخی از مشخصات آن به‌طور ویژه ارتقا یافته است.',
  details: [
    {
     company: "asus",
     cpu: 'core i7 13000',
     gpu: 'Geforce RTX 4070 8GB',
     memory: '64GB DDR5',
     storage: '1TB SSD',
     display: `نسبت تصویر: 16:9 / پوشش 100% دامنه رنگی sRGB و 75.35% Adobe / پشتیبانی از G-Sync ،MUX Switch و NVIDIA Advanced Optimus `,
    },
   ],
   price: 111_300_000,
   color: 'Gray'
 },
 {
  id: 8,
  title: 'لپ تاپ 13.6 اینچی اپل مدل MacBook Air MXCU3 2024 LLA-M3-16GB RAM-512GB SSD',
  image: '/47.Assets/8.png',
  caption: 'اگر به دنبال یک لپ تاپ حرفه‌ای و جذاب و در عین حال مناسب برای کارهای معمول و روزمره می‌گردید، بدن شک سری لپ تاپ مک‌بوک اپل از بهترین انتخاب‌ها برای شما خواهد بود. لپ تاپ مدل MacBook Air MXCU3 M3 2024 با داشتن اندازه 13.6 اینچی و وزن 1.24 کیلوگرم، انتخابی عالی برای حمل روزمره است و بدون هیچ مشکلی می‌توانید آن را همواره همراه خود داشته باشید. صفحه نمایش جذاب Retina IPS با روشنایی 500 نیت و پشتیبانی از یک میلیارد رنگ، جلوه بسیار زیبا و باکیفیتی دارد و می‌توانید از استفاده از آن لذت ببرید. از طرف دیگر پردازنده Apple M3 در کنار رم 16 گیگابایتی و پردازنده گرافیکی یکپارچه اپل، مجموعه بسیار خوبی را در کارهای مختلف به نمایش می‌گذارد. در کنار این‌ها حافظه 512 گیگابایتی از نوع SSD فضای لازم برای ذخیره اطلاعات ضروری را در اختیار شما قرار می‌دهد. وبکم باکیفیت، حسگر اثر انگشت سریع و حساس، پشتیبانی از شارژر MagSafe و پورت‌های کاربردی از دیگر ویژگی‌های خوب این لپ تاپ هستند که آن را به گزینه خرید مناسبی تبدیل می‌کنند. ',
  details: [
    {
     company: "apple",
     cpu: 'M3',
     gpu: 'M3 Max (integrated) ',
     memory: '16GB DDR5',
     storage: '512GB SSD',
     display: `صفحه نمایش رتینا با تکنولوژی IPS /میزان روشنایی صفحه نمایش: 500 نیت / توانایی نمایش 1 میلیارد رنگ /پشتیبانی از Wide color (P3) و تکنولوژی True Tone /پشتیبانی از صفحه نمایش ثانویه با وضوح تا 6K و نرخ 60 هرتز /پشتیبانی از HDR with Dolby Vision, HDR10 و HLG `,
    },
   ],
   price: 109_100_000,
   color: 'Yellow'
 },
 {
  id: 9,
  title: 'لپ تاپ 16.1 اینچی اچ‌ پی مدل Victus Gaming 16t-R100-i7 14700HX-32GB DDR5-512GB SSD-RTX4060-FHD-W - کاستوم شده',
  image: '/47.Assets/9.png',
  caption: 'سری جدید لپ‌تاپ‌های مخصوص بازی HP تحت عنوان Victus با طراحی شیک و سخت‌افزار قدرتمند عرضه شده تا نیاز کاربران برای اجرای بازی‌ها و برنامه‌ها سنگین را برطرف کند. لپ‌تاپ VICTUS 16 Gaming 16t-R100 یکی از بهترین گزینه‌ها در بازه‌ی قیمتی خود به شمار می‌آید که از قدرت کافی برای سنگین‌ترین پردازش‌ها و اجرای بازی‌ها با گرافیک بالا و نرخ فریم مناسب برخوردار است. پردازنده مرکزی Core i7 مدل 14700HX از 20 هسته و 28 رشته پردازشی بهره می‌برد و به خوبی از پس وظایف خود برمی‌آید. حافظه رم به‌روز DDR5 با فرکانس 4800 مگاهرتز برای این مدل در نظر گرفته شده تا خیال کاربر از اجرای روان چندین برنامه‌ به صورت همزمان و افزایش عملکرد کلی سیستم راحت باشد. حافظه SSD برای ذخیره اطلاعات و نصب بازی‌ها و برنامه‌ها کافی به نظر می‌رسد و با برخورداری از سرعت بالا، کاهش زمان بوت، انتقال فایل‌ها و بارگذاری‌های مختلف را به همراه دارد. پردازش‌های سنگین گرافیکی بر عهده عضو جدیدی سری 4000 گرافیک‌های انویدیا، یعنی GeForce RTX 4060 است که با 8 گیگابایت حافظه اختصاصی GDDR6، از توانایی کافی برای اجرای بازی‌های جدید با تنظیمات گرافیکی بالا و نرخ فریم روان برخوردار است. درضمن برد این لپ‌تاپ فضای کافی برای ارتقا رم تا 64 گیگابایت و حافظه SSD تا 2 ترابایت را هم داراست تا تمام نیازهای کاربران در این دو بخش کاملا برطرف شود. صفحه‌ نمایش Full HD با نرخ به‌روزرسانی 144 هرتز و روشنایی 300 نیتی مکمل قطعات دیگر بوده و با ارائه‌ی تجربه‌ای روان و سریع، به خوبی وظایف خود را انجام می‌دهد. این لپ‌تاپ 16.1 اینچی با وجود این ترکیب سخت‌افزار، حدودا 2.33 کیلوگرم وزن دارد. وبکم با کیفیت Full HD، بلندگوهای باکیفیت، نور پس زمینه سفید کیبورد، باتری 70 وات ساعتی با شارژ سریع و نصب ویندوز 11 به صورت پیش فرض، از ویژگی‌های مهم VICTUS 16 Gaming 16t-R100 به شمار می‌آیند.',
  details: 
    [{
     company: "HP",
     cpu: 'core i7 14000',
     gpu: 'Geforce RTX 4060 8GB',
     memory: '32GB DDR5',
     storage: '512gB SSD',
     display: `سری جدید لپ‌تاپ‌های مخصوص بازی HP تحت عنوان Victus با طراحی شیک و سخت‌افزار قدرتمند عرضه شده تا نیاز کاربران برای اجرای بازی‌ها و برنامه‌ها سنگین را برطرف کند. لپ‌تاپ VICTUS 16 Gaming 16t-R100 یکی از بهترین گزینه‌ها در بازه‌ی قیمتی خود به شمار می‌آید که از قدرت کافی برای سنگین‌ترین پردازش‌ها و اجرای بازی‌ها با گرافیک بالا و نرخ فریم مناسب برخوردار است. پردازنده مرکزی Core i7 مدل 14700HX از 20 هسته و 28 رشته پردازشی بهره می‌برد و به خوبی از پس وظایف خود برمی‌آید. حافظه رم به‌روز DDR5 با فرکانس 4800 مگاهرتز برای این مدل در نظر گرفته شده تا خیال کاربر از اجرای روان چندین برنامه‌ به صورت همزمان و افزایش عملکرد کلی سیستم راحت باشد. حافظه SSD برای ذخیره اطلاعات و نصب بازی‌ها و برنامه‌ها کافی به نظر می‌رسد و با برخورداری از سرعت بالا، کاهش زمان بوت، انتقال فایل‌ها و بارگذاری‌های مختلف را به همراه دارد. پردازش‌های سنگین گرافیکی بر عهده عضو جدیدی سری 4000 گرافیک‌های انویدیا، یعنی GeForce RTX 4060 است که با 8 گیگابایت حافظه اختصاصی GDDR6، از توانایی کافی برای اجرای بازی‌های جدید با تنظیمات گرافیکی بالا و نرخ فریم روان برخوردار است. درضمن برد این لپ‌تاپ فضای کافی برای ارتقا رم تا 64 گیگابایت و حافظه SSD تا 2 ترابایت را هم داراست تا تمام نیازهای کاربران در این دو بخش کاملا برطرف شود. صفحه‌ نمایش Full HD با نرخ به‌روزرسانی 144 هرتز و روشنایی 300 نیتی مکمل قطعات دیگر بوده و با ارائه‌ی تجربه‌ای روان و سریع، به خوبی وظایف خود را انجام می‌دهد. این لپ‌تاپ 16.1 اینچی با وجود این ترکیب سخت‌افزار، حدودا 2.33 کیلوگرم وزن دارد. وبکم با کیفیت Full HD، بلندگوهای باکیفیت، نور پس زمینه سفید کیبورد، باتری 70 وات ساعتی با شارژ سریع و نصب ویندوز 11 به صورت پیش فرض، از ویژگی‌های مهم VICTUS 16 Gaming 16t-R100 به شمار می‌آیند.`,
    }],
   price: 123_500_000,
   color: 'gray'
 },
]
export default productDatas